tap "homebrew/bundle"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "jq"
brew "lazygit"
brew "lsd"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "xcodes"
cask "1password"
cask "arc"
cask "clipy"
cask "font-hack-nerd-font"
cask "iterm2"
cask "logi-options+"
cask "obsidian"
cask "visual-studio-code"
